app/views/search/index.html.erb

          <h3><%= job["name"].gsub(/\S+/, &:capitalize) %></h3>
          <% job["locations"].each do |loc| %>
---
SELECT "locations".* FROM "locations"

          <br>
          <% job["levels"].each do |level| %>
---
SELECT "levels".* FROM "levels"