app/controllers/search_controller.rb

SELECT "locations".* FROM "locations"
SELECT "levels".* FROM "levels"
SELECT "companies".* FROM "companies"
SELECT "categories".* FROM "categories"
---
  def index
    @locations = []
    Location.all.each do |location|
      @locations << "#{location.city}, #{location.state}"
    end
    @levels = Level.all
    @companies = Company.all
    @categories = Category.all